In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Odczytaj plik 2017_jun_final.csv przy użyciu metody read_csv

In [2]:
df = pd.read_csv('2017_jun_final.csv')
print(df)

         N                      Role Programming language Specialisation   \
0        1        Junior QA engineer                  NaN       Manual QA
1        2        Junior QA engineer                  NaN       Manual QA
2        3         Software Engineer              C#/.NET             NaN
3        4         Software Engineer           JavaScript             NaN
4        5  Senior Software Engineer           JavaScript             NaN
...    ...                       ...                  ...             ...
8699  8700               QA engineer                  NaN       Manual QA
8700  8701                 Marketing                  NaN             NaN
8701  8702  Junior Software Engineer           Ruby/Rails             NaN
8702  8703                 Team lead                  NaN             NaN
8703  8704  Senior Software Engineer                 Java             NaN

            Experience  Experience on current job  Salary/month  \
0                   0.5                       0.5           400
1     loss then 3 month         loss then 3 month           430
2                     4                         1          2500
3                     5                         4          2000
4                  10+                        0.5          4500
...                 ...                       ...           ...
8699                  1         loss then 3 month           700
8700                0.5                       0.5           400
8701                  1                       0.5           800
8702                  6                         4          2600
8703                  7                         2          5000

      Изменение.зарплаты.за.12.месяцев       City              Company size  \
0                                    0  New York         up to 10 employees
1                                  130  New York   more then 1000 employees
2                                  800     Berlin      up to 1000 employees
3                                  400      Odesa       up to 200 employees
4                                  500      Other        up to 10 employees
...                                ...        ...                       ...
8699                               700      Odesa        up to 50 employees
8700                               120     Berlin        up to 50 employees
8701                               500       Rome        up to 10 employees
8702                                 0      Paris  more then 1000 employees
8703                               800      Odesa      up to 1000 employees

      ... Still student English                           Subject.area  \
0     ...          True       A1                         iOS,eCommerce
1     ...          True       B2                       Web development
2     ...         False       B1   Web development,Corporative systems
3     ...         False       A1  Desktop Applications,Web development
4     ...         False       B1  Desktop Applications,Web development
...   ...           ...      ...                                   ...
8699  ...         False       B1          Android,Desktop Applications
8700  ...         False       A1                             eCommerce
8701  ...         False       B2   Web development,Corporative systems
8702  ...         False       С1                               Finance
8703  ...         False       B2                       Web development

                     Date                                         User.Agent  \
0     12/06/2017 12:38:08  Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...
1     12/06/2017 12:42:51  Mozilla/5.0 (iPad; CPU OS 10_2_1 like Mac OS X...
2     12/06/2017 13:02:47  Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...
3     12/06/2017 13:03:01  Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...
4     12/06/2017 13:03:47  Mozilla/5.0 (iPhone; CPU iPhone OS 10_3_2 like...
...                   ...                                                ...
8699  12/07/2017 15:45:24  Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:54....
8700  12/07/2017 17:00:06  Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...
8701  12/07/2017 17:32:26  Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...
8702  12/07/2017 18:14:59  Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.3...
8703  12/07/2017 21:28:57  Mozilla/5.0 (iPad; CPU OS 10_3_2 like Mac OS X...

       exp current_job_exp salary Валюта  cls
0      0.5             0.5    400    NaN   QA
1      0.0             0.0    430    NaN   QA
2      4.0             1.0   2500    NaN  DEV
3      5.0             4.0   2000    NaN  DEV
4     10.0             0.5   4500    NaN  DEV
...    ...             ...    ...    ...  ...
8699   1.0             0.0    700    NaN   QA
8700   0.5             0.5    400    NaN  NaN
8701   1.0             0.5    800    NaN  DEV
8702   6.0             4.0   2600    NaN   PM
8703   7.0             2.0   5000    NaN  DEV

[8704 rows x 25 columns]

# Odczytaj tabelę wynikową przy użyciu metody head

In [3]:
print(df.head())

   N                      Role Programming language Specialisation   \
0  1        Junior QA engineer                  NaN       Manual QA
1  2        Junior QA engineer                  NaN       Manual QA
2  3         Software Engineer              C#/.NET             NaN
3  4         Software Engineer           JavaScript             NaN
4  5  Senior Software Engineer           JavaScript             NaN

         Experience  Experience on current job  Salary/month  \
0                0.5                       0.5           400
1  loss then 3 month         loss then 3 month           430
2                  4                         1          2500
3                  5                         4          2000
4               10+                        0.5          4500

   Изменение.зарплаты.за.12.месяцев       City              Company size  ...  \
0                                 0  New York         up to 10 employees  ...
1                               130  New York   more then 1000 employees  ...
2                               800     Berlin      up to 1000 employees  ...
3                               400      Odesa       up to 200 employees  ...
4                               500      Other        up to 10 employees  ...

  Still student English                           Subject.area  \
0          True       A1                         iOS,eCommerce
1          True       B2                       Web development
2         False       B1   Web development,Corporative systems
3         False       A1  Desktop Applications,Web development
4         False       B1  Desktop Applications,Web development

                  Date                                         User.Agent  \
0  12/06/2017 12:38:08  Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...
1  12/06/2017 12:42:51  Mozilla/5.0 (iPad; CPU OS 10_2_1 like Mac OS X...
2  12/06/2017 13:02:47  Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...
3  12/06/2017 13:03:01  Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...
4  12/06/2017 13:03:47  Mozilla/5.0 (iPhone; CPU iPhone OS 10_3_2 like...

    exp current_job_exp salary Валюта  cls
0   0.5             0.5    400    NaN   QA
1   0.0             0.0    430    NaN   QA
2   4.0             1.0   2500    NaN  DEV
3   5.0             4.0   2000    NaN  DEV
4  10.0             0.5   4500    NaN  DEV

[5 rows x 25 columns]

# Zdefiniuj rozmiar tabeli przy użyciu metody shape

In [4]:
print(df.shape)

(8704, 25)

# Zdefiniuj typy wszystkich kolumn za pomocą metody dataframe.dtypes

In [5]:
print(df.dtypes)

N                                     int64
Role                                 object
Programming language                 object
Specialisation                       object
Experience                           object
Experience on current job            object
Salary/month                          int64
Изменение.зарплаты.за.12.месяцев      int64
City                                 object
Company size                         object
Company type                         object
Gender                               object
Age                                   int64
Education                            object
University                           object
Still student                          bool
English                              object
Subject.area                         object
Date                                 object
User.Agent                           object
exp                                 float64
current_job_exp                     float64
salary                                int64
Валюта                               object
cls                                  object
dtype: object

# Oblicz proporcję spacji w każdej kolumnie (użyj metod isnull i sum).

In [6]:
print(df.isnull().mean())

N                                   0.000000
Role                                0.000000
Programming language                0.442325
Specialisation                      0.829389
Experience                          0.000000
Experience on current job           0.000000
Salary/month                        0.000000
Изменение.зарплаты.за.12.месяцев    0.000000
City                                0.000000
Company size                        0.000000
Company type                        0.000000
Gender                              0.000000
Age                                 0.000000
Education                           0.000000
University                          0.177619
Still student                       0.000000
English                             0.000000
Subject.area                        0.025620
Date                                0.000000
User.Agent                          0.000000
exp                                 0.000000
current_job_exp                     0.000000
salary                              0.000000
Валюта                              0.998851
cls                                 0.180836
dtype: float64

# Usuń wszystkie kolumny ze spacjami z wyjątkiem kolumny "Język programowania"

In [7]:
df_empty_proportions = df.isnull().sum() / len(df)
df_empty_proportions_columns = df_empty_proportions[df_empty_proportions > 0].index
columns_to_drop = [col for col in df_empty_proportions_columns if col != "Programming language"]
print("Kolumny do usunięcia: ", columns_to_drop)
df_clean = df.drop(axis=1, columns=columns_to_drop)
print("Dane bez kolumn z pustymi wartościami:")
print(df_clean)

Kolumny do usunięcia:  ['Specialisation ', 'University', 'Subject.area', 'Валюта', 'cls']
Dane bez kolumn z pustymi wartościami:
         N                      Role Programming language        Experience   \
0        1        Junior QA engineer                  NaN                0.5
1        2        Junior QA engineer                  NaN  loss then 3 month
2        3         Software Engineer              C#/.NET                  4
3        4         Software Engineer           JavaScript                  5
4        5  Senior Software Engineer           JavaScript               10+
...    ...                       ...                  ...                ...
8699  8700               QA engineer                  NaN                  1
8700  8701                 Marketing                  NaN                0.5
8701  8702  Junior Software Engineer           Ruby/Rails                  1
8702  8703                 Team lead                  NaN                  6
8703  8704  Senior Software Engineer                 Java                  7

     Experience on current job  Salary/month  \
0                          0.5           400
1            loss then 3 month           430
2                            1          2500
3                            4          2000
4                          0.5          4500
...                        ...           ...
8699         loss then 3 month           700
8700                       0.5           400
8701                       0.5           800
8702                         4          2600
8703                         2          5000

      Изменение.зарплаты.за.12.месяцев       City              Company size  \
0                                    0  New York         up to 10 employees
1                                  130  New York   more then 1000 employees
2                                  800     Berlin      up to 1000 employees
3                                  400      Odesa       up to 200 employees
4                                  500      Other        up to 10 employees
...                                ...        ...                       ...
8699                               700      Odesa        up to 50 employees
8700                               120     Berlin        up to 50 employees
8701                               500       Rome        up to 10 employees
8702                                 0      Paris  more then 1000 employees
8703                               800      Odesa      up to 1000 employees

     Company type  Gender  Age                    Education  Still student  \
0     Outsourcing  female   20  Unfinished Higher education           True
1     Outsourcing  female   21  Unfinished Higher education           True
2     Outsourcing    male   26             Higher education          False
3         product    male   30          Secondary education          False
4         product    male   30          Secondary education          False
...           ...     ...  ...                          ...            ...
8699  Outsourcing    male   23             Higher education          False
8700      product  female   22             Higher education          False
8701  Outstaffing    male   30  Unfinished Higher education          False
8702  Outsourcing    male   34             Higher education          False
8703      product    male   28             Higher education          False

     English                  Date  \
0          A1  12/06/2017 12:38:08
1          B2  12/06/2017 12:42:51
2          B1  12/06/2017 13:02:47
3          A1  12/06/2017 13:03:01
4          B1  12/06/2017 13:03:47
...       ...                  ...
8699       B1  12/07/2017 15:45:24
8700       A1  12/07/2017 17:00:06
8701       B2  12/07/2017 17:32:26
8702       С1  12/07/2017 18:14:59
8703       B2  12/07/2017 21:28:57

                                             User.Agent   exp  \
0     Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...   0.5
1     Mozilla/5.0 (iPad; CPU OS 10_2_1 like Mac OS X...   0.0
2     Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...   4.0
3     Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...   5.0
4     Mozilla/5.0 (iPhone; CPU iPhone OS 10_3_2 like...  10.0
...                                                 ...   ...
8699  Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:54....   1.0
8700  Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...   0.5
8701  Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...   1.0
8702  Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.3...   6.0
8703  Mozilla/5.0 (iPad; CPU OS 10_3_2 like Mac OS X...   7.0

      current_job_exp  salary
0                 0.5     400
1                 0.0     430
2                 1.0    2500
3                 4.0    2000
4                 0.5    4500
...               ...     ...
8699              0.0     700
8700              0.5     400
8701              0.5     800
8702              4.0    2600
8703              2.0    5000

[8704 rows x 20 columns]

# Ponownie policz odsetek pustych miejsc w każdej kolumnie i upewnij się, że pozostała tylko kolumna "Język programowania"

In [8]:
df_empty_proportions = df.isnull().sum() / len(df)
df_empty_proportions = df_clean.isnull().sum() / len(df_clean)
df_empty_proportions_columns = df_empty_proportions[df_empty_proportions > 0].index
print("Kolumna z pustymi miejscami w danych DataFrame:")
print(df_empty_proportions_columns)

Kolumna z pustymi miejscami w danych DataFrame:
Index(['Programming language'], dtype='object')

# Usuń wszystkie wiersze z oryginalnej tabeli za pomocą metody dropna

In [9]:
df_dropped_nan = df.dropna()
print(df_dropped_nan)

Empty DataFrame
Columns: [N, Role, Programming language, Specialisation , Experience , Experience on current job, Salary/month, Изменение.зарплаты.за.12.месяцев, City, Company size, Company type, Gender, Age, Education, University, Still student, English , Subject.area, Date, User.Agent, exp, current_job_exp, salary, Валюта, cls]
Index: []

[0 rows x 25 columns]

# Zdefiniuj nowy rozmiar tabeli za pomocą metody shape

In [10]:
df_dropped_nan = df.dropna()
print(df_dropped_nan.shape)

(0, 25)

# Utwórz nową tabelę python_data, która będzie zawierać tylko wiersze ze specjalistami, którzy podali język programowania Python

??

# Zdefiniuj rozmiar tabeli python_data za pomocą metody shape

??

# Używając metody [groupby](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html), pogrupuj według kolumny "Stanowisko"

In [11]:
df_group_by_role = df.groupby(by="Role")
print(df_group_by_role.size())

Role
Business analyst                               150
DBA                                             26
Data Scientist / Data Analyst                   79
Designer                                       223
DevOps                                         170
Director of Engineering / Program Director      44
ERP / CRM                                       12
Game designer                                   18
HR                                             247
HTML coder                                     156
Junior QA engineer                             404
Junior Software Engineer                      1280
Marketing                                      138
Product Manager                                 87
Project manager                                371
QA Tech Lead                                    79
QA engineer                                    738
Research Engineer                               14
Sales manager                                   85
Scrum Master                                    19
Security Specialist                             12
Senior Project Manager / Program Manager        66
Senior QA engineer                             263
Senior Software Engineer                      1080
Software Engineer                             2168
Support                                        115
Sysadmin                                       129
System Architect                                65
Talent Researcher                               36
Team lead                                      152
Technical Lead                                 250
Technical writer                                28
dtype: int64

# Utwórz nowy DataFrame, w którym dla danych pogrupowanych według kolumny "Stanowisko" wykonaj agregację danych za pomocą metody [agg](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.agg.html) i znajdź minimalne i maksymalne wartości w kolumnie "Wynagrodzenie.za.miesiąc"

In [12]:
df_group_by_role = df.groupby(by="Role")
df_group_by_role_salary_min = df_group_by_role["Salary/month"].agg("min").reset_index().rename(columns={"Salary/month" : "Salary/month: min"})
df_group_by_role_salary_max = df_group_by_role["Salary/month"].agg("max").reset_index().rename(columns={"Salary/month" : "Salary/month: max"})
df_group_by_role_salary_min_max = pd.concat([df_group_by_role_salary_min, df_group_by_role_salary_max])
print(df_group_by_role_salary_min_max)

                             Role  Salary/month: min  Salary/month: max
0                Business analyst              200.0                NaN
1                             DBA              380.0                NaN
2   Data Scientist / Data Analyst              150.0                NaN
3                        Designer              100.0                NaN
4                          DevOps              194.0                NaN
..                            ...                ...                ...
27               System Architect                NaN            10000.0
28              Talent Researcher                NaN             1700.0
29                      Team lead                NaN             7000.0
30                 Technical Lead                NaN            18000.0
31               Technical writer                NaN             3000.0

[64 rows x 3 columns]

# Utwórz funkcję fill_avg_salary, która zwróci średnią miesięczną pensję. Użyj jej w metodzie [apply](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html) i utwórz nową kolumnę "avg"

In [13]:
df_group_by_role = df.groupby(by="Role")
df_group_by_role_salary_min = df_group_by_role["Salary/month"].agg("min").reset_index().rename(columns={"Salary/month" : "Salary/month: min"})
df_group_by_role_salary_max = df_group_by_role["Salary/month"].agg("max").reset_index().rename(columns={"Salary/month" : "Salary/month: max"})
df_group_by_role_salary_mean = df_group_by_role["Salary/month"].apply(np.mean).reset_index().rename(columns={"Salary/month" : "avg"})
df_group_by_role_salary = pd.concat([df_group_by_role_salary_min, df_group_by_role_salary_max, df_group_by_role_salary_mean])
print(df_group_by_role_salary)

                             Role  Salary/month: min  Salary/month: max  \
0                Business analyst              200.0                NaN
1                             DBA              380.0                NaN
2   Data Scientist / Data Analyst              150.0                NaN
3                        Designer              100.0                NaN
4                          DevOps              194.0                NaN
..                            ...                ...                ...
27               System Architect                NaN                NaN
28              Talent Researcher                NaN                NaN
29                      Team lead                NaN                NaN
30                 Technical Lead                NaN                NaN
31               Technical writer                NaN                NaN

            avg
0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
..          ...
27  4387.076923
28   550.555556
29  2836.328947
30  3664.272000
31  1127.892857

[96 rows x 4 columns]

# Utwórz statystyki opisowe za pomocą metody describe dla nowej kolumny

In [14]:
df_group_by_role = df.groupby(by="Role")
df_group_by_role_salary_min = df_group_by_role["Salary/month"].agg("min").reset_index().rename(columns={"Salary/month" : "Salary/month: min"})
df_group_by_role_salary_max = df_group_by_role["Salary/month"].agg("max").reset_index().rename(columns={"Salary/month" : "Salary/month: max"})
df_group_by_role_salary_mean = df_group_by_role["Salary/month"].apply(np.mean).reset_index().rename(columns={"Salary/month" : "avg"})
df_group_by_role_salary = pd.concat([df_group_by_role_salary_min, df_group_by_role_salary_max, df_group_by_role_salary_mean])
print(df_group_by_role_salary.describe())

       Salary/month: min  Salary/month: max          avg
count          32.000000            32.0000    32.000000
mean          250.031250          6648.4375  1800.566187
std           258.096817          5957.2602  1170.804714
min            75.000000          1700.0000   482.774752
25%           100.000000          3487.5000   858.532807
50%           172.000000          5500.0000  1528.543434
75%           312.500000          7250.0000  2363.147188
max          1500.000000         34000.0000  5066.363636

# Zapisz wynikową tabelę w pliku CSV

In [15]:
df_group_by_role = df.groupby(by="Role")
df_group_by_role_salary_min = df_group_by_role["Salary/month"].agg("min").reset_index().rename(columns={"Salary/month" : "Salary/month: min"})
df_group_by_role_salary_max = df_group_by_role["Salary/month"].agg("max").reset_index().rename(columns={"Salary/month" : "Salary/month: max"})
df_group_by_role_salary_mean = df_group_by_role["Salary/month"].apply(np.mean).reset_index().rename(columns={"Salary/month" : "avg"})
df_group_by_role_salary = pd.concat([df_group_by_role_salary_min, df_group_by_role_salary_max, df_group_by_role_salary_mean])
df_statistics = df_group_by_role_salary.describe()
df_statistics.to_csv("df_statistics.csv", index=False)